/**
 * 第一步：先搭建好node环境，这个对于前端来说基操，不会的百度下，不讲解
 *
 *
 * 第二步：初始化项目。进入文件夹先`npm init`，配置完后`npm install`。你也可以先建个server.js文件，这样默认启动项就会改为server.js，否则
 * 默认为index.js
 *
 * 第三步：一个简单的node输出：在server.js中输入`console.log(1)`，然后在命令行运行：`node server.js`，就可以看到命令行中输出的1。一个简单
 * 的node输出就完成了。至此，你已经步入了node入门的门槛
 *
 * 第四步：创建一个服务器，使我们在本地能够访问。nodejs是前端比较容易学的后端服务功能，它的出现是为了让前端在不用学习一门新的语言的情况下实现后端
 * 的一些功能。最常见的后端功能就是创建一个服务，然用户在浏览器中输入ip地址就能访问到页面。第四步详情代码见server1.js。server.js只是用来备注的。
 * 测试功能的话只要通过node运行对应的js文件即可。官方api文档：http://nodejs.cn/api/
 */
